<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Skype For Business.</string>
	<key>Identifier</key>
	<string>com.github.rskolden.download.SkypeForBusiness</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Skype For Business</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
      <key>Processor</key>
        <string>URLTextSearcher</string>
        <key>Arguments</key>
          <dict>
            <key>url</key>
            <string>https://www.microsoft.com/en-us/download/confirmation.aspx?id=54108</string>
            <key>re_pattern</key>
            <string>&lt;a href="(?P&lt;url&gt;https://.*/SkypeForBusinessInsatller.*\.pkg)"&gt;</string>
          </dict>
    </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
